{
  "id": 2,
  "title": "Una línea que nadie vigila",
  "subject": "Calidad, seguridad y aspectos biosicosociales en UCI",
  "description": "Caso para evaluar conceptos de calidad asistencial y seguridad del paciente en UCI, aplicado a un escenario donde se deben detectar fallos en protocolos Zero, clasificar incidentes y tomar decisiones críticas.",
  "character": {
    "name": "Laura Peña",
    "avatar": "https://i.postimg.cc/3NMC3hQz/enfermera-UCI-avatar.png"
  },
  "nodes": {
    "start": {
      "text": "Durante el cambio de turno, detectas que el apósito del catéter venoso central del paciente está húmedo y parcialmente despegado. También observas falta de registros recientes sobre el mantenimiento del CVC. El paciente inicia febrícula (37.8°C). Debes decidir cómo actuar.",
      "media": {
        "type": "image",
        "url": "https://i.postimg.cc/KzJSmShz/cvc-risk.jpg"
      },
      "options": [
        {
          "text": "Avisar inmediatamente al intensivista y reportar el hallazgo.",
          "next": "node_2A",
          "scores": { "C1": 3, "C2": 1, "C3": 2, "C4": 3 }
        },
        {
          "text": "Recolocar el apósito sin registrar el incidente.",
          "next": "node_2B",
          "scores": { "C1": -2, "C2": -3, "C3": -1, "C4": -2 }
        },
        {
          "text": "Revisar primero la historia clínica para confirmar incumplimientos.",
          "next": "node_2C",
          "scores": { "C1": 1, "C2": 2, "C3": 2, "C4": 1 }
        }
      ]
    },

    "node_2A": {
      "text": "El intensivista solicita hemocultivos, revisión del CVC y pide documentar el incidente como posible cuasi-incidente. El supervisor solicita añadirlo al análisis diario de seguridad.",
      "options": [
        {
          "text": "Documentar el incidente y sugerir evaluar cumplimiento del proyecto Bacteriemia Zero.",
          "next": "end_positive",
          "scores": { "C1": 3, "C2": 3, "C3": 2, "C4": 3 }
        },
        {
          "text": "Realizar las pruebas sin insistir en el análisis del incidente.",
          "next": "end_neutral",
          "scores": { "C1": 1, "C2": 1, "C3": 1, "C4": 0 }
        }
      ]
    },

    "node_2B": {
      "text": "Recolocas el apósito, pero el paciente progresa a fiebre de 38.7°C. El intensivista pregunta si hubo alguna alteración previa, pero nadie sabe responder.",
      "options": [
        {
          "text": "Reconocer ahora que hubo un problema en el apósito y que no se notificó.",
          "next": "node_3B",
          "scores": { "C1": -1, "C2": -1, "C3": -1, "C4": -2 }
        },
        {
          "text": "Mantener silencio para no asumir responsabilidad.",
          "next": "end_negative",
          "scores": { "C1": -3, "C2": -3, "C3": -2, "C4": -3 }
        }
      ]
    },

    "node_2C": {
      "text": "Revisas la historia y confirman falta de registros y ausencia de checklist de Bacteriemia Zero.",
      "options": [
        {
          "text": "Informar al supervisor con datos objetivos antes de avisar al médico.",
          "next": "node_3C",
          "scores": { "C1": 2, "C2": 2, "C3": 3, "C4": 2 }
        },
        {
          "text": "Resolver la situación por tu cuenta para agilizar el turno.",
          "next": "node_2B",
          "scores": { "C1": -1, "C2": -2, "C3": -1, "C4": -1 }
        }
      ]
    },

    "node_3B": {
      "text": "El equipo considera que ocultar información ha dificultado el análisis de un posible evento adverso evitable.",
      "options": [
        {
          "text": "Proponer un indicador semanal de revisión de CVC.",
          "next": "end_neutral",
          "scores": { "C1": 1, "C2": 1, "C3": 2, "C4": 1 }
        },
        {
          "text": "Justificar la falta de notificación por exceso de carga laboral.",
          "next": "end_negative",
          "scores": { "C1": -2, "C2": -2, "C3": -1, "C4": -2 }
        }
      ]
    },

    "node_3C": {
      "text": "El supervisor inicia una mini-auditoría rápida y se identifica incumplimiento del proyecto Zero en varias camas.",
      "options": [
        {
          "text": "Sugerir un briefing de seguridad y revisión inmediata del protocolo.",
          "next": "end_positive",
          "scores": { "C1": 3, "C2": 2, "C3": 3, "C4": 3 }
        },
        {
          "text": "Limitarse a compartir los datos sin proponer mejoras.",
          "next": "end_neutral",
          "scores": { "C1": 1, "C2": 1, "C3": 2, "C4": 1 }
        }
      ]
    },

    "end_positive": {
      "text": "Final positivo: El análisis precoz evitó una bacteriemia. Se reforzaron protocolos Zero, se revisaron indicadores de proceso y se instauró un sistema de notificación activa.",
      "options": []
    },

    "end_neutral": {
      "text": "Final neutro: El episodio se resolvió sin impacto significativo en la mejora estructural. No hubo deterioro del paciente, pero tampoco aprendizaje organizativo relevante.",
      "options": []
    },

    "end_negative": {
      "text": "Final negativo: El paciente desarrolla bacteriemia relacionada con el CVC. La auditoría detecta fallos de proceso, ausencia de notificación y baja cultura de seguridad.",
      "options": []
    },

    "end": {}
  }
}
