{
  "id": 1,
  "title": "Una línea que nadie vigila",
  "subject": "Calidad, seguridad y aspectos biosicosociales en UCI",
  "description": "Caso de simulación sobre la identificación de riesgos asociados a CVC, aplicación de Proyectos Zero, análisis de incidentes y evaluación crítica de la calidad asistencial en UCI.",
  "character": { 
    "name": "Laura Peña", 
    "avatar": "https://i.postimg.cc/0QN2W07G/avatar-generico-medic.png" 
  },
  "nodes": {
    "start": {
      "text": "Durante el cambio de turno en la UCI, Laura observa que el apósito del CVC de Andrés está húmedo y parcialmente despegado. El paciente inicia febrícula. No hay registro reciente del último cambio de sistemas ni del checklist del protocolo Zero. Debe decidir qué hacer.",
      "media": { "type": "image", "url": "https://i.postimg.cc/kGj4ZtfF/uci-generic.jpg" },
      "options": [
        { 
          "text": "Avisar inmediatamente al Dr. Salazar y reportar el hallazgo.", 
          "next": "node_2A",
          "scores": { "c1": 3, "c2": 1, "c3": 2, "c4": 3 }
        },
        { 
          "text": "Recolocar el apósito sin registrar el incidente para evitar conflictos.", 
          "next": "node_2B",
          "scores": { "c1": -2, "c2": -3, "c3": -1, "c4": -2 }
        },
        { 
          "text": "Revisar toda la historia clínica y hojas de cuidados antes de actuar.",
          "next": "node_2C",
          "scores": { "c1": 1, "c2": 2, "c3": 2, "c4": 1 }
        }
      ]
    },

    "node_2A": {
      "text": "El Dr. Salazar agradece la notificación y pide hemocultivos y revisión del CVC. El supervisor considera que puede tratarse de un cuasi-incidente y pide documentarlo.",
      "options": [
        {
          "text": "Documentar el incidente y sugerir evaluar el cumplimiento de Bacteriemia Zero.",
          "next": "final_positivo",
          "scores": { "c1": 3, "c2": 3, "c3": 2, "c4": 3 }
        },
        {
          "text": "Realizar las pruebas sin insistir en el análisis del incidente.",
          "next": "final_neutro",
          "scores": { "c1": 1, "c2": 1, "c3": 1, "c4": 0 }
        }
      ]
    },

    "node_2B": {
      "text": "Laura recoloca el apósito sin reportar el incidente. Más tarde el paciente desarrolla fiebre alta. El intensivista pregunta si hubo alteraciones previas, pero nadie sabe responder.",
      "options": [
        {
          "text": "Reconocer ahora que hubo un problema en el apósito y no se notificó.",
          "next": "node_3B",
          "scores": { "c1": -1, "c2": -1, "c3": -1, "c4": -2 }
        },
        {
          "text": "Mantener silencio para no asumir responsabilidad.",
          "next": "final_negativo",
          "scores": { "c1": -3, "c2": -3, "c3": -2, "c4": -3 }
        }
      ]
    },

    "node_2C": {
      "text": "Laura revisa la documentación y detecta que no se cumplió el checklist de Proyectos Zero y faltan registros en las últimas 8 horas.",
      "options": [
        {
          "text": "Informar al supervisor con datos antes de avisar al médico.",
          "next": "node_3C",
          "scores": { "c1": 2, "c2": 2, "c3": 3, "c4": 2 }
        },
        {
          "text": "Resolver la situación por su cuenta para agilizar el turno.",
          "next": "node_2B",
          "scores": { "c1": -1, "c2": -2, "c3": -1, "c4": -1 }
        }
      ]
    },

    "node_3B": {
      "text": "El equipo señala que ocultar información ha dificultado el análisis del evento. Se considera que podría ser un evento evitable vinculado a fallos de proceso.",
      "options": [
        {
          "text": "Proponer implementar un indicador semanal de revisión de CVC.",
          "next": "final_neutro",
          "scores": { "c1": 1, "c2": 1, "c3": 2, "c4": 1 }
        },
        {
          "text": "Justificar la falta de notificación por exceso de carga laboral.",
          "next": "final_negativo",
          "scores": { "c1": -2, "c2": -2, "c3": -1, "c4": -2 }
        }
      ]
    },

    "node_3C": {
      "text": "El supervisor agradece el análisis y decide activar una mini auditoría. Se detectan incumplimientos del protocolo Zero en otras camas.",
      "options": [
        {
          "text": "Sugerir un briefing de seguridad y revisión inmediata del protocolo.",
          "next": "final_positivo",
          "scores": { "c1": 3, "c2": 2, "c3": 3, "c4": 3 }
        },
        {
          "text": "Limitarse a compartir los datos sin proponer mejoras.",
          "next": "final_neutro",
          "scores": { "c1": 1, "c2": 1, "c3": 2, "c4": 1 }
        }
      ]
    },

    "final_positivo": {
      "text": "La actuación precoz evitó una bacteriemia. Se reforzaron los protocolos Zero y se instauró un sistema de notificación activa. Caso exitoso."
    },

    "final_neutro": {
      "text": "El episodio se resolvió sin impacto estructural en la calidad de la unidad. No hubo empeoramiento, pero tampoco aprendizaje organizativo relevante."
    },

    "final_negativo": {
      "text": "El paciente desarrolla una bacteriemia relacionada con el CVC. Se detectan fallos en el proceso y cultura de seguridad insuficiente."
    }
  }
}
